In [71]:
import pandas as pd

In [72]:
data = {
    "a":[1,2,3,4],
    "b":[4,5,6,7],
    "c":["sudh", "krish", "hitesh", "navin"]
}

In [73]:
data

{'a': [1, 2, 3, 4],
 'b': [4, 5, 6, 7],
 'c': ['sudh', 'krish', 'hitesh', 'navin']}

In [74]:
pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [75]:
df = pd.DataFrame(data, index = ['a', 'b', 'c', 'd'])

In [76]:
df.set_index('c')

        a  b
c
sudh    1  4
krish   2  5
hitesh  3  6
navin   4  7

In [77]:
df

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [78]:
df.set_index('c')

        a  b
c
sudh    1  4
krish   2  5
hitesh  3  6
navin   4  7

In [79]:
df

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [80]:
df.reset_index()

  index  a  b       c
0     a  1  4    sudh
1     b  2  5   krish
2     c  3  6  hitesh
3     d  4  7   navin

In [81]:
df

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [82]:
df.reindex(['b', 'c', 'a', 'd'])

   a  b       c
b  2  5   krish
c  3  6  hitesh
a  1  4    sudh
d  4  7   navin

In [83]:
df

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [86]:
for i in df.iterrows():
    print(i)

('a', a       1
b       4
c    sudh
Name: a, dtype: object)
('b', a        2
b        5
c    krish
Name: b, dtype: object)
('c', a         3
b         6
c    hitesh
Name: c, dtype: object)
('d', a        4
b        7
c    navin
Name: d, dtype: object)

In [88]:
for i in df.iteritems():
    print(i)

('a', a    1
b    2
c    3
d    4
Name: a, dtype: int64)
('b', a    4
b    5
c    6
d    7
Name: b, dtype: int64)
('c', a      sudh
b     krish
c    hitesh
d     navin
Name: c, dtype: object)

/tmp/ipykernel_1695/36948316.py:1: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for i in df.iteritems():

In [89]:
df

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [91]:
def test(x):
    return x.sum()

df.apply(test, axis=0)

a                      10
b                      22
c    sudhkrishhiteshnavin
dtype: object

In [93]:
df2 = df[['a', 'b']]
df2

   a  b
a  1  4
b  2  5
c  3  6
d  4  7

In [94]:
df2.applymap(lambda x: x**2)

    a   b
a   1  16
b   4  25
c   9  36
d  16  49

In [95]:
df

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [96]:
df.sort_values('c')

   a  b       c
c  3  6  hitesh
b  2  5   krish
d  4  7   navin
a  1  4    sudh

In [97]:
df.sort_index()

   a  b       c
a  1  4    sudh
b  2  5   krish
c  3  6  hitesh
d  4  7   navin

In [98]:
df.sort_index(ascending=False)

   a  b       c
d  4  7   navin
c  3  6  hitesh
b  2  5   krish
a  1  4    sudh

In [99]:
df3 = pd.DataFrame({
"desc":["Close Up (1990) in Farsi. This fiction-documentary hybrid uses a sensational real-life event; The arrest of a young man on charges that he fraudulently impersonated the well-known filmmaker Mohsen Makhmalbaf — as the basis for a stunning, multilayered investigation into movies, identity, artistic creation, and existence, in which the real people from the case play themselves"]
})

In [100]:
df3

                                                desc
0  Close Up (1990) in Farsi. This fiction-documen...

In [101]:
pd.set_option("display.max_colwidth", 100)

In [102]:
df3

                                                                                                  desc
0  Close Up (1990) in Farsi. This fiction-documentary hybrid uses a sensational real-life event; Th...

In [103]:

pd.set_option("display.max_colwidth", 1000)

In [104]:
df3

                                                                                                                                                                                                                                                                                                                                                                                        desc
0  Close Up (1990) in Farsi. This fiction-documentary hybrid uses a sensational real-life event; The arrest of a young man on charges that he fraudulently impersonated the well-known filmmaker Mohsen Makhmalbaf — as the basis for a stunning, multilayered investigation into movies, identity, artistic creation, and existence, in which the real people from the case play themselves

In [105]:
t = "i used to data data science masters class"

len(t.split())

8

In [106]:
df3['word_count'] = df3['desc'].apply(lambda x: len(x.split()))

In [107]:
df3

,desc,word_count
0,"Close Up (1990) in Farsi. This fiction-documentary hybrid uses a sensational real-life event; The arrest of a young man on charges that he fraudulently impersonated the well-known filmmaker Mohsen Makhmalbaf — as the basis for a stunning, multilayered investigation into movies, identity, artistic creation, and existence, in which the real people from the case play themselves",56

In [108]:
df['a'].mean()

2.5

In [109]:
df['a'].median()

2.5

In [110]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [111]:
df['a'].std()

1.2909944487358056

In [112]:
df['a'].var()

1.6666666666666667

In [114]:
df['a'].min()

1

In [115]:
df['a'].max()

4

In [116]:
df['a'].sum()

10

In [117]:
## Python Pandas  - Window functions

In [118]:
df4 = pd.DataFrame({
    'a':[1,2,3,4,4,52,3,22,23,42,]
})

In [119]:
df4

    a
0   1
1   2
2   3
3   4
4   4
5  52
6   3
7  22
8  23
9  42

In [121]:
df4.rolling(window=1)

Rolling [window=1,center=False,axis=0,method=single]

In [123]:
df4.rolling(window=1).mean()

      a
0   1.0
1   2.0
2   3.0
3   4.0
4   4.0
5  52.0
6   3.0
7  22.0
8  23.0
9  42.0

In [124]:
df4.rolling(window=2).mean()

      a
0   NaN
1   1.5
2   2.5
3   3.5
4   4.0
5  28.0
6  27.5
7  12.5
8  22.5
9  32.5

In [125]:
df4.rolling(window=5).mean()

      a
0   NaN
1   NaN
2   NaN
3   NaN
4   2.8
5  13.0
6  13.2
7  17.0
8  20.8
9  28.4

In [126]:
df4.rolling(window=5).sum()

       a
0    NaN
1    NaN
2    NaN
3    NaN
4   14.0
5   65.0
6   66.0
7   85.0
8  104.0
9  142.0

In [127]:
df4.cumsum()

     a
0    1
1    3
2    6
3   10
4   14
5   66
6   69
7   91
8  114
9  156

In [128]:
# python pandas - Date functionality

In [131]:
data = pd.date_range(start='2022-02-22', end='2022-06-22')

In [132]:
data

DatetimeIndex(['2022-02-22', '2022-02-23', '2022-02-24', '2022-02-25',
               '2022-02-26', '2022-02-27', '2022-02-28', '2022-03-01',
               '2022-03-02', '2022-03-03',
               ...
               '2022-06-13', '2022-06-14', '2022-06-15', '2022-06-16',
               '2022-06-17', '2022-06-18', '2022-06-19', '2022-06-20',
               '2022-06-21', '2022-06-22'],
              dtype='datetime64[ns]', length=121, freq='D')

In [133]:
df_date = pd.DataFrame(data)

In [134]:
df_date

             0
0   2022-02-22
1   2022-02-23
2   2022-02-24
3   2022-02-25
4   2022-02-26
..         ...
116 2022-06-18
117 2022-06-19
118 2022-06-20
119 2022-06-21
120 2022-06-22

[121 rows x 1 columns]

In [136]:
type(df_date)

pandas.core.frame.DataFrame

In [137]:
df_date.dtypes

0    datetime64[ns]
dtype: object

In [138]:
df7 = pd.DataFrame({
    "date":["2022-06-22", "2022-06-19"]
})

In [139]:
df7

         date
0  2022-06-22
1  2022-06-19

In [140]:
df7.dtypes

date    object
dtype: object

In [143]:
df7['update_date'] = pd.to_datetime(df7['date'])

In [144]:
df7

         date update_date
0  2022-06-22  2022-06-22
1  2022-06-19  2022-06-19

In [145]:
df7.dtypes

date                   object
update_date    datetime64[ns]
dtype: object

In [151]:
df7['year'] = df7['update_date'].dt.year

In [152]:
df7

         date update_date  year
0  2022-06-22  2022-06-22  2022
1  2022-06-19  2022-06-19  2022

In [153]:
df7['month'] = df7['update_date'].dt.month

In [154]:
df7

         date update_date  year  month
0  2022-06-22  2022-06-22  2022      6
1  2022-06-19  2022-06-19  2022      6

In [155]:
df7['day'] = df7['update_date'].dt.day

In [156]:
df7

         date update_date  year  month  day
0  2022-06-22  2022-06-22  2022      6   22
1  2022-06-19  2022-06-19  2022      6   19

In [157]:
## Python Pandas - Time Delta

In [158]:
pd.Timedelta(days=1)

Timedelta('1 days 00:00:00')

In [159]:
pd.Timedelta(days=1, hours = 5)

Timedelta('1 days 05:00:00')

In [163]:
time = pd.Timedelta(days=1, hours = 5, minutes=34)

In [164]:
time

Timedelta('1 days 05:34:00')

In [161]:
dt = pd.to_datetime('2022-06-20')

In [162]:
dt

Timestamp('2022-06-20 00:00:00')

In [165]:
dt - time

Timestamp('2022-06-18 18:26:00')

In [166]:
dt + time

Timestamp('2022-06-21 05:34:00')

In [169]:
# python pandas - categorical data
data = ['prasad', 'DSA', 'HElp', 'help']
cat =pd.Categorical(data)

In [170]:
cat

['prasad', 'DSA', 'HElp', 'help']
Categories (4, object): ['DSA', 'HElp', 'help', 'prasad']

In [172]:
cat.value_counts()

DSA       1
HElp      1
help      1
prasad    1
dtype: int64

In [ ]:
## python pandas - visualize

d = pd.s